{
    "projects": [
        {
            "project-id": "registrar-now",
            "project-name": "RegistrarNOW!",
            "project-description": "RegistrarNOW! is a web application which performs as a basic university registration system for Administrators, Professors, and Students. The application allows students to send and receive messages from Academic Advising. Users can login, enroll in classes, view course listings, update personal info, view grades with their class rank, class grade distribution and final schedule.",
            "tech-stack": [
                "C#",
                "ASP.NET",
                "KnockoutJS",
                "HTML",
                "CSS",
                "MSSQL"
            ]
        },        
        {
            "project-id": "dopamemes",
            "project-name": "Dopamemes",
            "project-description": "Dopamemes is a web app which allows users to create, upload, and organize memes. There is also a chrome extension that complements this web application. This web app features saving memes in albums, sorting memes, and rating memes. Users can also drag and drop and upload memes from their desktop and save it to their only library.",
            "tech-stack": [
                "Firebase",
                "AngularJS",
                "HTML",
                "CSS"
            ]
        },
        {
            "project-id": "sha-1",
            "project-name": "SHA-1 Hash Algorithm",
            "project-description": "This is a simulated design of the SHA-1 Hash Algorithm developed in Verilog. The simulated design takes input of a message and computes it into a 160-bit SHA1 hash. The simulated design utilizes multiple pipelines to increase performance of the algorithm and reduce area delay between the execution of each instruction.",
            "tech-stack": [
                "Verilog"
            ]
        },
        {
            "project-id": "beanme",
            "project-name": "BeanMe!",
            "project-description": "BeanMe! is an Android app that simplifies group ordering for coffee runners. BeanMe! allows users to host coffee runs, invite friends to the runs, and get invited to the coffee run. It works by a having a host create a run which notifies the users in the run to send their order to the friend that is taking their orders. So, throw away the pen and paper and just BeanMe!",
            "tech-stack": [
                "Java",
                "Android SDK",
                "Parse"
            ]
        }
    ]
}